# CircleMultiPlanarShapeInSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..CircleMultiPlanarShapeInSketch Property
BuiltInFailures..::..SketchFailures Class See Also
---
A circle can't be converted to multiplanar shape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircleMultiPlanarShapeInSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircleMultiPlanarShapeInSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircleMultiPlanarShapeInSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace